In [2]:
import pandas as pd
import numpy as np

In [3]:
df1 = pd.read_csv('coordinates.csv', sep=';')
df2 = pd.read_csv('data_2017.csv', sep=',')

In [4]:
df1

,country,latitude,longitude,Area,Unnamed: 4,Unnamed: 5,Unnamed: 6
0,AD,42.546245,1.601554,Andorra,NaN,NaN,NaN
1,AE,23.424076,53.847818,United Arab Emirates,NaN,NaN,NaN
2,AF,33.939110,67.709953,Afghanistan,NaN,NaN,NaN
3,AG,17.060816,-61.796428,Antigua and Barbuda,NaN,NaN,NaN
4,AI,18.220554,-63.068615,Anguilla,NaN,NaN,NaN
...,...,...,...,...,...,...,...
240,YE,15.552727,48.516388,Yemen,NaN,NaN,NaN
241,YT,-12.827500,45.166244,Mayotte,NaN,NaN,NaN
242,ZA,-30.559482,22.937506,South Africa,NaN,NaN,NaN
243,ZM,-13.133897,27.849332,Zambia,NaN,NaN,NaN
244,ZW,-19.015438,29.154857,Zimbabwe,NaN,NaN,NaN

In [5]:
df2

,Domain Code,Domain,Area Code,Area,Element Code,Element,Item Code,Item,Year Code,Year,Unit,Value,Flag,Flag Description,Note
0,FBS,New Food Balances,2,Afghanistan,5123,Losses,2511,Wheat and products,2017,2017,1000 tonnes,642,S,Standardized data,NaN
1,FBS,New Food Balances,2,Afghanistan,5123,Losses,2805,Rice and products,2017,2017,1000 tonnes,24,S,Standardized data,NaN
2,FBS,New Food Balances,2,Afghanistan,5123,Losses,2513,Barley and products,2017,2017,1000 tonnes,14,S,Standardized data,NaN
3,FBS,New Food Balances,2,Afghanistan,5123,Losses,2514,Maize and products,2017,2017,1000 tonnes,26,S,Standardized data,NaN
4,FBS,New Food Balances,2,Afghanistan,5123,Losses,2517,Millet and products,2017,2017,1000 tonnes,0,S,Standardized data,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
5808,FBS,New Food Balances,181,Zimbabwe,5123,Losses,2732,Mutton & Goat Meat,2017,2017,1000 tonnes,1,S,Standardized data,NaN
5809,FBS,New Food Balances,181,Zimbabwe,5123,Losses,2733,Pigmeat,2017,2017,1000 tonnes,1,S,Standardized data,NaN
5810,FBS,New Food Balances,181,Zimbabwe,5123,Losses,2734,Poultry Meat,2017,2017,1000 tonnes,3,S,Standardized data,NaN
5811,FBS,New Food Balances,181,Zimbabwe,5123,Losses,2744,Eggs,2017,2017,1000 tonnes,1,S,Standardized data,NaN
5812,FBS,New Food Balances,181,Zimbabwe,5123,Losses,2848,Milk - Excluding Butter,2017,2017,1000 tonnes,21,S,Standardized data,NaN

In [6]:
df_clean = pd.merge(df2, df1[["latitude", "longitude", "Area", "country"]] , on='Area')

In [7]:
df_clean.drop(['Domain Code', 'Domain', "Element Code", "Element", "Item Code", "Flag", "Flag Description", "Note" ], axis=1, inplace=True)

In [8]:
df_clean.sample(2)

,Area Code,Area,Item,Year Code,Year,Unit,Value,latitude,longitude,country
3256,149,Nepal,"Roots, Other",2017,2017,1000 tonnes,26,28.394857,84.124008,NP
1740,79,Germany,Yams,2017,2017,1000 tonnes,0,51.165691,10.451526,DE

In [9]:
# df_clean.to_csv("long_lat_data.csv", sep='\t', encoding='utf-8')